magnate3/rtemskit/arch/arm/stm32f7/include/soc.h
#ifndef STM32F7_SOC_H_
#define STM32F7_SOC_H_

#include "stm32f7xx_hal.h"

#include "stm32f7xx_ll_adc.h"
#include "stm32f7xx_ll_bus.h"
#include "stm32f7xx_ll_cortex.h"
#include "stm32f7xx_ll_crc.h"
#include "stm32f7xx_ll_dac.h"
#include "stm32f7xx_ll_dma.h"
#include "stm32f7xx_ll_dma2d.h"
#include "stm32f7xx_ll_exti.h"
#include "stm32f7xx_ll_fmc.h"
#include "stm32f7xx_ll_gpio.h"
#include "stm32f7xx_ll_i2c.h"
#include "stm32f7xx_ll_iwdg.h"
#include "stm32f7xx_ll_lptim.h"
#include "stm32f7xx_ll_pwr.h"
#include "stm32f7xx_ll_rcc.h"
#include "stm32f7xx_ll_rng.h"
#include "stm32f7xx_ll_rtc.h"
#include "stm32f7xx_ll_sdmmc.h"
#include "stm32f7xx_ll_spi.h"
#include "stm32f7xx_ll_system.h"
#include "stm32f7xx_ll_tim.h"
#include "stm32f7xx_ll_usart.h"
#include "stm32f7xx_ll_usb.h"
#include "stm32f7xx_ll_utils.h"
#include "stm32f7xx_ll_wwdg.h"

#include "board/stm32f7/stm32_pinmux.h"
#include "board/stm32f7/stm32f7_pinmux.h"

#endif /* STM32F7_SOC_H_ */
